-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 15, 2021 at 09:24 AM
-- Server version: 10.4.20-MariaDB
-- PHP Version: 8.0.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `db_test`
--

-- --------------------------------------------------------

--
-- Table structure for table `amphures`
--

CREATE TABLE `amphures` (
  `id` int(5) NOT NULL,
  `code` varchar(4) COLLATE utf8_unicode_ci NOT NULL,
  `name_th` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `name_en` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `province_id` int(5) NOT NULL DEFAULT 0
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `amphures`
--

INSERT INTO `amphures` (`id`, `code`, `name_th`, `name_en`, `province_id`) VALUES
(1, '1001', 'คณะเกษตรศาสตร์', 'คณะเกษตรศาสตร์', 1),
(2, '1002', 'คณะบริหารธุรกิจ', 'คณะบริหารธุรกิจ', 1),
(3, '1003', 'คณะวิทยาศาสตร์และเทคโนโลยี', 'คณะวิทยาศาสตร์และเทคโนโลยี', 1),
(4, '1004', 'คณะวิศวกรรมศาสตร์', 'คณะวิศวกรรมศาสตร์', 1),
(5, '1005', 'คณะศิลปศาสตร์', 'คณะศิลปศาสตร์', 1),
(6, '1006', 'คณะสัตวแพทยศาสตร์', 'คณะสัตวแพทยศาสตร์', 1),
(7, '1007', 'คณะสถาปัตยกรรมศาสตร์', 'คณะสถาปัตยกรรมศาสตร์', 1),
(8, '1008', 'คณะอุตสาหกรรมเกษตร', 'คณะอุตสาหกรรมเกษตร', 1),
(9, '1009', 'คณะเทคโนโลยีการจัดการ', 'คณะเทคโนโลยีการจัดการ', 1),
(10, '1010', 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี', 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี', 1),
(11, '1101', 'คณะเกษตรศาสตร์', 'คณะเกษตรศาสตร์', 2),
(12, '1102', 'คณะบริหารธุรกิจ', 'คณะบริหารธุรกิจ', 2),
(13, '1103', 'คณะวิทยาศาสตร์และเทคโนโลยี', 'คณะวิทยาศาสตร์และเทคโนโลยี', 2),
(14, '1104', 'คณะวิศวกรรมศาสตร์', 'คณะวิศวกรรมศาสตร์', 2),
(15, '1105', 'คณะศิลปศาสตร์', 'คณะศิลปศาสตร์', 2),
(16, '1106', 'คณะสัตวแพทยศาสตร์', 'คณะสัตวแพทยศาสตร์', 2),
(17, '1107', 'คณะสถาปัตยกรรมศาสตร์', 'คณะสถาปัตยกรรมศาสตร์', 2),
(18, '1108', 'คณะอุตสาหกรรมเกษตร', 'คณะอุตสาหกรรมเกษตร', 2),
(19, '1109', 'คณะเทคโนโลยีการจัดการ', 'คณะเทคโนโลยีการจัดการ', 2),
(20, '1110', 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี', 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี', 2),
(21, '1201', 'คณะเกษตรศาสตร์', 'คณะเกษตรศาสตร์', 3),
(22, '1202', 'คณะบริหารธุรกิจ', 'คณะบริหารธุรกิจ', 3),
(23, '1203', 'คณะวิทยาศาสตร์และเทคโนโลยี', 'คณะวิทยาศาสตร์และเทคโนโลยี', 3),
(24, '1204', 'คณะวิศวกรรมศาสตร์', 'คณะวิศวกรรมศาสตร์', 3),
(25, '1205', 'คณะศิลปศาสตร์', 'คณะศิลปศาสตร์', 3),
(26, '1206', 'คณะสัตวแพทยศาสตร์', 'คณะสัตวแพทยศาสตร์', 3),
(27, '1207', 'คณะสถาปัตยกรรมศาสตร์', 'คณะสถาปัตยกรรมศาสตร์', 3),
(28, '1208', 'คณะอุตสาหกรรมเกษตร', 'คณะอุตสาหกรรมเกษตร', 3),
(29, '1209', 'คณะเทคโนโลยีการจัดการ', 'คณะเทคโนโลยีการจัดการ', 3),
(30, '1210', 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี', 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี', 3),
(31, '1301', 'คณะเกษตรศาสตร์', 'คณะเกษตรศาสตร์', 4),
(32, '1302', 'คณะบริหารธุรกิจ', 'คณะบริหารธุรกิจ', 4),
(33, '1303', 'คณะวิทยาศาสตร์และเทคโนโลยี', 'คณะวิทยาศาสตร์และเทคโนโลยี', 4),
(34, '1304', 'คณะวิศวกรรมศาสตร์', 'คณะวิศวกรรมศาสตร์', 4),
(35, '1305', 'คณะศิลปศาสตร์', 'คณะศิลปศาสตร์', 4),
(36, '1306', 'คณะสัตวแพทยศาสตร์', 'คณะสัตวแพทยศาสตร์', 4),
(37, '1307', 'คณะสถาปัตยกรรมศาสตร์', 'คณะสถาปัตยกรรมศาสตร์', 4),
(38, '1308', 'คณะอุตสาหกรรมเกษตร', 'คณะอุตสาหกรรมเกษตร', 4),
(39, '1309', 'คณะเทคโนโลยีการจัดการ', 'คณะเทคโนโลยีการจัดการ', 4),
(40, '1310', 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี', 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี', 4),
(41, '1401', 'คณะเกษตรศาสตร์', 'คณะเกษตรศาสตร์', 5),
(42, '1402', 'คณะบริหารธุรกิจ', 'คณะบริหารธุรกิจ', 5),
(43, '1403', 'คณะวิทยาศาสตร์และเทคโนโลยี', 'คณะวิทยาศาสตร์และเทคโนโลยี', 5),
(44, '1404', 'คณะวิศวกรรมศาสตร์', 'คณะวิศวกรรมศาสตร์', 5),
(45, '1405', 'คณะศิลปศาสตร์', 'คณะศิลปศาสตร์', 5),
(46, '1406', 'คณะสัตวแพทยศาสตร์', 'คณะสัตวแพทยศาสตร์', 5),
(47, '1407', 'คณะสถาปัตยกรรมศาสตร์', 'คณะสถาปัตยกรรมศาสตร์', 5),
(48, '1408', 'คณะอุตสาหกรรมเกษตร', 'คณะอุตสาหกรรมเกษตร', 5),
(49, '1409', 'คณะเทคโนโลยีการจัดการ', 'คณะเทคโนโลยีการจัดการ', 5),
(50, '1410', 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี', 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี', 5),
(51, '1501', 'คณะเกษตรศาสตร์', 'คณะเกษตรศาสตร์', 6),
(52, '1502', 'คณะบริหารธุรกิจ', 'คณะบริหารธุรกิจ', 6),
(53, '1503', 'คณะวิทยาศาสตร์และเทคโนโลยี', 'คณะวิทยาศาสตร์และเทคโนโลยี', 6),
(54, '1504', 'คณะวิศวกรรมศาสตร์', 'คณะวิศวกรรมศาสตร์', 6),
(55, '1505', 'คณะศิลปศาสตร์', 'คณะศิลปศาสตร์', 6),
(56, '1506', 'คณะสัตวแพทยศาสตร์', 'คณะสัตวแพทยศาสตร์', 6),
(57, '1507', 'คณะสถาปัตยกรรมศาสตร์', 'คณะสถาปัตยกรรมศาสตร์', 6),
(58, '1508', 'คณะอุตสาหกรรมเกษตร', 'คณะอุตสาหกรรมเกษตร', 6),
(59, '1509', 'คณะเทคโนโลยีการจัดการ', 'คณะเทคโนโลยีการจัดการ', 6),
(60, '1510', 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี', 'คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี', 6);

-- --------------------------------------------------------

--
-- Table structure for table `districts`
--

CREATE TABLE `districts` (
  `id` varchar(6) COLLATE utf8_bin NOT NULL,
  `zip_code` int(11) NOT NULL,
  `name_th` varchar(150) COLLATE utf8_bin NOT NULL,
  `name_en` varchar(150) COLLATE utf8_bin NOT NULL,
  `amphure_id` int(11) NOT NULL DEFAULT 0
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='InnoDB free: 8192 kB';

--
-- Dumping data for table `districts`
--

INSERT INTO `districts` (`id`, `zip_code`, `name_th`, `name_en`, `amphure_id`) VALUES
('100101', 1, 'ประมง', 'ประมง', 1),
('100102', 2, 'พืชศาสตร์', 'พืชศาสตร์', 1),
('100103', 3, 'สัตวศาสตร์', 'สัตวศาสตร์', 1),
('100104', 4, 'เกษตรกลวิธาน', 'เกษตรกลวิธาน', 1),
('100105', 5, 'เทคโนโลยีการผลิตพืช', 'เทคโนโลยีการผลิตพืช', 1),
('100106', 6, 'เทคโนโลยีภูมิทัศน์', 'เทคโนโลยีภูมิทัศน์', 1),
('100107', 7, 'เทคโนโลยีเครื่องจักรกลเกษตร', 'เทคโนโลยีเครื่องจักรกลเกษตร', 1),
('100108', 8, 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 1),
('100109', 9, 'การเพาะเลี้ยงสัตว์น้ำและการจัดการทรัพยากรประมง', 'การเพาะเลี้ยงสัตว์น้ำและการจัดการทรัพยากรประมง', 1),
('100201', 11, 'การจัดการ', 'การจัดการ', 2),
('100202', 12, 'การตลาด', 'การตลาด', 2),
('100203', 13, 'การเงิน', 'การเงิน', 2),
('100204', 14, 'ระบบสารสนเทศทางธุรกิจ', 'ระบบสารสนเทศทางธุรกิจ', 2),
('100205', 15, 'การบัญชี', 'การบัญชี', 2),
('100206', 16, 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 2),
('100301', 18, 'ชีววิทยาประยุกต์', 'ชีววิทยาประยุกต์', 3),
('100302', 19, 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 3),
('100303', 20, 'เคมี', 'เคมี', 3),
('100304', 21, 'เคมีอุตสาหกรรม', 'เคมีอุตสาหกรรม', 3),
('100305', 22, 'เทคโนโลยีการยาง', 'เทคโนโลยีการยาง', 3),
('100306', 23, 'เทคโนโลยีการอาหาร', 'เทคโนโลยีการอาหาร', 3),
('100307', 24, 'เทคโนโลยีคอมพิวเตอร์', 'เทคโนโลยีคอมพิวเตอร์', 3),
('100308', 25, 'เทคโนโลยีสารสนเทศ', 'เทคโนโลยีสารสนเทศ', 3),
('100309', 26, 'เทคโนโลยีอุตสาหการ', 'เทคโนโลยีอุตสาหการ', 3),
('100310', 27, 'เทคนิคอุตสาหกรรม', 'เทคนิคอุตสาหกรรม', 3),
('100311', 28, 'การแพทย์แผนไทย', 'การแพทย์แผนไทย', 3),
('100312', 29, 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 3),
('100401', 31, 'วิศวกรรมการผลิต', 'วิศวกรรมการผลิต', 4),
('100402', 32, 'วิศวกรรมคอมพิวเตอร์', 'วิศวกรรมคอมพิวเตอร์', 4),
('100403', 33, 'วิศวกรรมสำรวจ', 'วิศวกรรมสำรวจ', 4),
('100404', 34, 'วิศวกรรมอิเล็กทรอนิกส์', 'วิศวกรรมอิเล็กทรอนิกส์', 4),
('100405', 35, 'วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ', 4),
('100406', 36, 'วิศวกรรมเครื่องกล', 'วิศวกรรมเครื่องกล', 4),
('100407', 37, 'วิศวกรรมเครื่องนุ่งห่ม', 'วิศวกรรมเครื่องนุ่งห่ม', 4),
('100408', 38, 'วิศวกรรมโยธา', 'วิศวกรรมโยธา', 4),
('100409', 39, 'วิศวกรรมไฟฟ้า', 'วิศวกรรมไฟฟ้า', 4),
('100410', 40, 'เทคโนโลยีคอมพิวเตอร์', 'เทคโนโลยีคอมพิวเตอร์', 4),
('100411', 41, 'เทคโนโลยีอุตสาหกรรม', 'เทคโนโลยีอุตสาหกรรม', 4),
('100412', 42, 'เทคโนโลยีเครื่องกล', 'เทคโนโลยีเครื่องกล', 4),
('100413', 43, 'วิศวกรรมโทรคมนาคม', 'วิศวกรรมโทรคมนาคม', 4),
('100501', 45, 'การท่องเที่ยว', 'การท่องเที่ยว', 5),
('100502', 46, 'การโรงแรม', 'การโรงแรม', 5),
('100503', 47, 'คหกรรมศาสตร์ทั่วไป ธุรกิจงานประดิษฐ์', 'คหกรรมศาสตร์ทั่วไป ธุรกิจงานประดิษฐ์', 5),
('100504', 48, 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 5),
('100505', 49, 'อาหารและโภชนาการ', 'อาหารและโภชนาการ', 5),
('100506', 50, 'คหกรรมศาสตร์ศึกษา-คหกรรมศาสตร์ทั่วไป', 'คหกรรมศาสตร์ศึกษา-คหกรรมศาสตร์ทั่วไป', 5),
('100507', 51, 'ธุรกิจคหกรรมศาสตร์', 'ธุรกิจคหกรรมศาสตร์', 5),
('100601', 53, 'สัตวแพทยศาสตร์', 'สัตวแพทยศาสตร์', 6),
('100701', 56, 'จิตรกรรม', 'จิตรกรรม', 7),
('100702', 57, 'สถาปัตยกรรม', 'สถาปัตยกรรม', 7),
('100703', 58, 'การออกแบบแฟชั่นและสิ่งทอ', 'การออกแบบแฟชั่นและสิ่งทอ', 7),
('100801', 61, 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร', 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร', 8),
('100802', 62, 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 8),
('100803', 63, 'อาหารและโภชนาการ', 'อาหารและโภชนาการ', 8),
('100804', 64, 'เทคโนโลยีชีวภาพ', 'เทคโนโลยีชีวภาพ', 8),
('100901', 66, 'การจัดการ', 'การจัดการ', 9),
('100902', 67, 'การตลาด', 'การตลาด', 9),
('100903', 68, 'การเงิน', 'การเงิน', 9),
('100904', 69, 'การจัดการโลจิสติกส์', 'การจัดการโลจิสติกส์', 9),
('100905', 70, 'ระบบสารสนเทศทางธุรกิจ', 'ระบบสารสนเทศทางธุรกิจ', 9),
('100906', 71, 'ธุรกิจอิเล็กทรอนิกส์', 'ธุรกิจอิเล็กทรอนิกส์', 9),
('100907', 72, 'การบัญชี', 'การบัญชี', 9),
('100908', 73, 'คอมพิวเตอร์ธุรกิจ', 'คอมพิวเตอร์ธุรกิจ', 9),
('101001', 76, 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 10),
('101002', 77, 'วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ', 10),
('101003', 78, 'เทคโนโลยีการขึ้นรูปโลหะ', 'เทคโนโลยีการขึ้นรูปโลหะ', 10),
('101004', 79, 'เทคโนโลยีปิโตรเลียม', 'เทคโนโลยีปิโตรเลียม', 10),
('101005', 80, 'เทคโนโลยีสื่อสารมวลชน', 'เทคโนโลยีสื่อสารมวลชน', 10),
('101006', 81, 'วิศวกรรมแมคคาทรอนิกส์', 'วิศวกรรมแมคคาทรอนิกส์', 10),
('110101', 141, 'ประมง', 'ประมง', 11),
('110102', 142, 'พืชศาสตร์', 'พืชศาสตร์', 11),
('110103', 143, 'สัตวศาสตร์', 'สัตวศาสตร์', 11),
('110104', 144, 'เกษตรกลวิธาน', 'เกษตรกลวิธาน', 11),
('110105', 145, 'เทคโนโลยีการผลิตพืช', 'เทคโนโลยีการผลิตพืช', 11),
('110106', 146, 'เทคโนโลยีภูมิทัศน์', 'เทคโนโลยีภูมิทัศน์', 11),
('110107', 147, 'เทคโนโลยีเครื่องจักรกลเกษตร', 'เทคโนโลยีเครื่องจักรกลเกษตร', 11),
('110108', 148, 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 11),
('110109', 149, 'การเพาะเลี้ยงสัตว์น้ำและการจัดการทรัพยากรประมง', 'การเพาะเลี้ยงสัตว์น้ำและการจัดการทรัพยากรประมง', 11),
('110201', 150, 'การจัดการ', 'การจัดการ', 12),
('110202', 151, 'การตลาด', 'การตลาด', 12),
('110203', 152, 'การเงิน', 'การเงิน', 12),
('110204', 153, 'ระบบสารสนเทศทางธุรกิจ', 'ระบบสารสนเทศทางธุรกิจ', 12),
('110205', 154, 'การบัญชี', 'การบัญชี', 12),
('110206', 155, 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 12),
('110301', 156, 'ชีววิทยาประยุกต์', 'ชีววิทยาประยุกต์', 13),
('110302', 157, 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 13),
('110303', 158, 'เคมี', 'เคมี', 13),
('110304', 159, 'เคมีอุตสาหกรรม', 'เคมีอุตสาหกรรม', 13),
('110305', 160, 'เทคโนโลยีการยาง', 'เทคโนโลยีการยาง', 13),
('110306', 161, 'เทคโนโลยีการอาหาร', 'เทคโนโลยีการอาหาร', 13),
('110307', 162, 'เทคโนโลยีคอมพิวเตอร์', 'เทคโนโลยีคอมพิวเตอร์', 13),
('110308', 163, 'เทคโนโลยีสารสนเทศ', 'เทคโนโลยีสารสนเทศ', 13),
('110309', 164, 'เทคโนโลยีอุตสาหการ', 'เทคโนโลยีอุตสาหการ', 13),
('110310', 165, 'เทคนิคอุตสาหกรรม', 'เทคนิคอุตสาหกรรม', 13),
('110311', 166, 'การแพทย์แผนไทย', 'การแพทย์แผนไทย', 13),
('110312', 167, 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 13),
('110401', 168, 'วิศวกรรมการผลิต', 'วิศวกรรมการผลิต', 14),
('110402', 169, 'วิศวกรรมคอมพิวเตอร์', 'วิศวกรรมคอมพิวเตอร์', 14),
('110403', 170, 'วิศวกรรมสำรวจ', 'วิศวกรรมสำรวจ', 14),
('110404', 171, 'วิศวกรรมอิเล็กทรอนิกส์', 'วิศวกรรมอิเล็กทรอนิกส์', 14),
('110405', 172, 'วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ', 14),
('110406', 173, 'วิศวกรรมเครื่องกล', 'วิศวกรรมเครื่องกล', 14),
('110407', 174, 'วิศวกรรมเครื่องนุ่งห่ม', 'วิศวกรรมเครื่องนุ่งห่ม', 14),
('110408', 175, 'วิศวกรรมโยธา', 'วิศวกรรมโยธา', 14),
('110409', 176, 'วิศวกรรมไฟฟ้า', 'วิศวกรรมไฟฟ้า', 14),
('110410', 177, 'เทคโนโลยีคอมพิวเตอร์', 'เทคโนโลยีคอมพิวเตอร์', 14),
('110411', 178, 'เทคโนโลยีอุตสาหกรรม', 'เทคโนโลยีอุตสาหกรรม', 14),
('110412', 179, 'เทคโนโลยีเครื่องกล', 'เทคโนโลยีเครื่องกล', 14),
('110413', 180, 'วิศวกรรมโทรคมนาคม', 'วิศวกรรมโทรคมนาคม', 14),
('110501', 181, 'การท่องเที่ยว', 'การท่องเที่ยว', 15),
('110502', 182, 'การโรงแรม', 'การโรงแรม', 15),
('110503', 183, 'คหกรรมศาสตร์ทั่วไป ธุรกิจงานประดิษฐ์', 'คหกรรมศาสตร์ทั่วไป ธุรกิจงานประดิษฐ์', 15),
('110504', 184, 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 15),
('110505', 185, 'อาหารและโภชนาการ', 'อาหารและโภชนาการ', 15),
('110506', 186, 'คหกรรมศาสตร์ศึกษา-คหกรรมศาสตร์ทั่วไป', 'คหกรรมศาสตร์ศึกษา-คหกรรมศาสตร์ทั่วไป', 15),
('110507', 187, 'ธุรกิจคหกรรมศาสตร์', 'ธุรกิจคหกรรมศาสตร์', 15),
('110601', 188, 'สัตวแพทยศาสตร์', 'สัตวแพทยศาสตร์', 16),
('110701', 189, 'จิตรกรรม', 'จิตรกรรม', 17),
('110702', 190, 'สถาปัตยกรรม', 'สถาปัตยกรรม', 17),
('110703', 191, 'การออกแบบแฟชั่นและสิ่งทอ', 'การออกแบบแฟชั่นและสิ่งทอ', 17),
('110801', 192, 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร', 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร', 18),
('110802', 193, 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 18),
('110803', 194, 'อาหารและโภชนาการ', 'อาหารและโภชนาการ', 18),
('110804', 195, 'เทคโนโลยีชีวภาพ', 'เทคโนโลยีชีวภาพ', 18),
('110901', 196, 'การจัดการ', 'การจัดการ', 19),
('110902', 197, 'การตลาด', 'การตลาด', 19),
('110903', 198, 'การเงิน', 'การเงิน', 19),
('110904', 199, 'การจัดการโลจิสติกส์', 'การจัดการโลจิสติกส์', 19),
('110905', 200, 'ระบบสารสนเทศทางธุรกิจ', 'ระบบสารสนเทศทางธุรกิจ', 19),
('110906', 201, 'ธุรกิจอิเล็กทรอนิกส์', 'ธุรกิจอิเล็กทรอนิกส์', 19),
('110907', 202, 'การบัญชี', 'การบัญชี', 19),
('110908', 203, 'คอมพิวเตอร์ธุรกิจ', 'คอมพิวเตอร์ธุรกิจ', 19),
('111001', 204, 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 20),
('111002', 205, 'วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ', 20),
('111003', 206, 'เทคโนโลยีการขึ้นรูปโลหะ', 'เทคโนโลยีการขึ้นรูปโลหะ', 20),
('111004', 207, 'เทคโนโลยีปิโตรเลียม', 'เทคโนโลยีปิโตรเลียม', 20),
('111005', 208, 'เทคโนโลยีสื่อสารมวลชน', 'เทคโนโลยีสื่อสารมวลชน', 20),
('111006', 209, 'วิศวกรรมแมคคาทรอนิกส์', 'วิศวกรรมแมคคาทรอนิกส์', 20),
('120101', 211, 'ประมง', 'ประมง', 21),
('120102', 212, 'พืชศาสตร์', 'พืชศาสตร์', 21),
('120103', 213, 'สัตวศาสตร์', 'สัตวศาสตร์', 21),
('120104', 214, 'เกษตรกลวิธาน', 'เกษตรกลวิธาน', 21),
('120105', 215, 'เทคโนโลยีการผลิตพืช', 'เทคโนโลยีการผลิตพืช', 21),
('120106', 216, 'เทคโนโลยีภูมิทัศน์', 'เทคโนโลยีภูมิทัศน์', 21),
('120107', 217, 'เทคโนโลยีเครื่องจักรกลเกษตร', 'เทคโนโลยีเครื่องจักรกลเกษตร', 21),
('120108', 218, 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 21),
('120109', 219, 'การเพาะเลี้ยงสัตว์น้ำและการจัดการทรัพยากรประมง', 'การเพาะเลี้ยงสัตว์น้ำและการจัดการทรัพยากรประมง', 21),
('120201', 220, 'การจัดการ', 'การจัดการ', 22),
('120202', 221, 'การตลาด', 'การตลาด', 22),
('120203', 222, 'การเงิน', 'การเงิน', 22),
('120204', 223, 'ระบบสารสนเทศทางธุรกิจ', 'ระบบสารสนเทศทางธุรกิจ', 22),
('120205', 224, 'การบัญชี', 'การบัญชี', 22),
('120206', 225, 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 22),
('120301', 226, 'ชีววิทยาประยุกต์', 'ชีววิทยาประยุกต์', 23),
('120302', 227, 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 23),
('120303', 228, 'เคมี', 'เคมี', 23),
('120304', 229, 'เคมีอุตสาหกรรม', 'เคมีอุตสาหกรรม', 23),
('120305', 230, 'เทคโนโลยีการยาง', 'เทคโนโลยีการยาง', 23),
('120306', 231, 'เทคโนโลยีการอาหาร', 'เทคโนโลยีการอาหาร', 23),
('120307', 232, 'เทคโนโลยีคอมพิวเตอร์', 'เทคโนโลยีคอมพิวเตอร์', 23),
('120308', 233, 'เทคโนโลยีสารสนเทศ', 'เทคโนโลยีสารสนเทศ', 23),
('120309', 234, 'เทคโนโลยีอุตสาหการ', 'เทคโนโลยีอุตสาหการ', 23),
('120310', 235, 'เทคนิคอุตสาหกรรม', 'เทคนิคอุตสาหกรรม', 23),
('120311', 236, 'การแพทย์แผนไทย', 'การแพทย์แผนไทย', 23),
('120312', 237, 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 23),
('120401', 238, 'วิศวกรรมการผลิต', 'วิศวกรรมการผลิต', 24),
('120402', 239, 'วิศวกรรมคอมพิวเตอร์', 'วิศวกรรมคอมพิวเตอร์', 24),
('120403', 240, 'วิศวกรรมสำรวจ', 'วิศวกรรมสำรวจ', 24),
('120404', 241, 'วิศวกรรมอิเล็กทรอนิกส์', 'วิศวกรรมอิเล็กทรอนิกส์', 24),
('120405', 242, 'วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ', 24),
('120406', 243, 'วิศวกรรมเครื่องกล', 'วิศวกรรมเครื่องกล', 24),
('120407', 244, 'วิศวกรรมเครื่องนุ่งห่ม', 'วิศวกรรมเครื่องนุ่งห่ม', 24),
('120408', 245, 'วิศวกรรมโยธา', 'วิศวกรรมโยธา', 24),
('120409', 246, 'วิศวกรรมไฟฟ้า', 'วิศวกรรมไฟฟ้า', 24),
('120410', 247, 'เทคโนโลยีคอมพิวเตอร์', 'เทคโนโลยีคอมพิวเตอร์', 24),
('120411', 248, 'เทคโนโลยีอุตสาหกรรม', 'เทคโนโลยีอุตสาหกรรม', 24),
('120412', 249, 'เทคโนโลยีเครื่องกล', 'เทคโนโลยีเครื่องกล', 24),
('120413', 250, 'วิศวกรรมโทรคมนาคม', 'วิศวกรรมโทรคมนาคม', 24),
('120501', 251, 'การท่องเที่ยว', 'การท่องเที่ยว', 25),
('120502', 252, 'การโรงแรม', 'การโรงแรม', 25),
('120503', 253, 'คหกรรมศาสตร์ทั่วไป ธุรกิจงานประดิษฐ์', 'คหกรรมศาสตร์ทั่วไป ธุรกิจงานประดิษฐ์', 25),
('120504', 254, 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 25),
('120505', 255, 'อาหารและโภชนาการ', 'อาหารและโภชนาการ', 25),
('120506', 256, 'คหกรรมศาสตร์ศึกษา-คหกรรมศาสตร์ทั่วไป', 'คหกรรมศาสตร์ศึกษา-คหกรรมศาสตร์ทั่วไป', 25),
('120507', 257, 'ธุรกิจคหกรรมศาสตร์', 'ธุรกิจคหกรรมศาสตร์', 25),
('120601', 258, 'สัตวแพทยศาสตร์', 'สัตวแพทยศาสตร์', 26),
('120701', 259, 'จิตรกรรม', 'จิตรกรรม', 27),
('120702', 260, 'สถาปัตยกรรม', 'สถาปัตยกรรม', 27),
('120703', 261, 'การออกแบบแฟชั่นและสิ่งทอ', 'การออกแบบแฟชั่นและสิ่งทอ', 27),
('120801', 262, 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร', 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร', 28),
('120802', 263, 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 28),
('120803', 264, 'อาหารและโภชนาการ', 'อาหารและโภชนาการ', 28),
('120804', 265, 'เทคโนโลยีชีวภาพ', 'เทคโนโลยีชีวภาพ', 28),
('120901', 266, 'การจัดการ', 'การจัดการ', 29),
('120902', 267, 'การตลาด', 'การตลาด', 29),
('120903', 268, 'การเงิน', 'การเงิน', 29),
('120904', 269, 'การจัดการโลจิสติกส์', 'การจัดการโลจิสติกส์', 29),
('120905', 270, 'ระบบสารสนเทศทางธุรกิจ', 'ระบบสารสนเทศทางธุรกิจ', 29),
('120906', 271, 'ธุรกิจอิเล็กทรอนิกส์', 'ธุรกิจอิเล็กทรอนิกส์', 29),
('120907', 272, 'การบัญชี', 'การบัญชี', 29),
('120908', 273, 'คอมพิวเตอร์ธุรกิจ', 'คอมพิวเตอร์ธุรกิจ', 29),
('121001', 274, 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 30),
('121002', 275, 'วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ', 30),
('121003', 276, 'เทคโนโลยีการขึ้นรูปโลหะ', 'เทคโนโลยีการขึ้นรูปโลหะ', 30),
('121004', 277, 'เทคโนโลยีปิโตรเลียม', 'เทคโนโลยีปิโตรเลียม', 30),
('121005', 278, 'เทคโนโลยีสื่อสารมวลชน', 'เทคโนโลยีสื่อสารมวลชน', 30),
('121006', 279, 'วิศวกรรมแมคคาทรอนิกส์', 'วิศวกรรมแมคคาทรอนิกส์', 30),
('130101', 281, 'ประมง', 'ประมง', 31),
('130102', 282, 'พืชศาสตร์', 'พืชศาสตร์', 31),
('130103', 283, 'สัตวศาสตร์', 'สัตวศาสตร์', 31),
('130104', 284, 'เกษตรกลวิธาน', 'เกษตรกลวิธาน', 31),
('130105', 285, 'เทคโนโลยีการผลิตพืช', 'เทคโนโลยีการผลิตพืช', 31),
('130106', 286, 'เทคโนโลยีภูมิทัศน์', 'เทคโนโลยีภูมิทัศน์', 31),
('130107', 287, 'เทคโนโลยีเครื่องจักรกลเกษตร', 'เทคโนโลยีเครื่องจักรกลเกษตร', 31),
('130108', 288, 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 31),
('130109', 289, 'การเพาะเลี้ยงสัตว์น้ำและการจัดการทรัพยากรประมง', 'การเพาะเลี้ยงสัตว์น้ำและการจัดการทรัพยากรประมง', 31),
('130201', 290, 'การจัดการ', 'การจัดการ', 32),
('130202', 291, 'การตลาด', 'การตลาด', 32),
('130203', 292, 'การเงิน', 'การเงิน', 32),
('130204', 293, 'ระบบสารสนเทศทางธุรกิจ', 'ระบบสารสนเทศทางธุรกิจ', 32),
('130205', 294, 'การบัญชี', 'การบัญชี', 32),
('130206', 295, 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 32),
('130301', 296, 'ชีววิทยาประยุกต์', 'ชีววิทยาประยุกต์', 33),
('130302', 297, 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 33),
('130303', 298, 'เคมี', 'เคมี', 33),
('130304', 299, 'เคมีอุตสาหกรรม', 'เคมีอุตสาหกรรม', 33),
('130305', 300, 'เทคโนโลยีการยาง', 'เทคโนโลยีการยาง', 33),
('130306', 301, 'เทคโนโลยีการอาหาร', 'เทคโนโลยีการอาหาร', 33),
('130307', 302, 'เทคโนโลยีคอมพิวเตอร์', 'เทคโนโลยีคอมพิวเตอร์', 33),
('130308', 303, 'เทคโนโลยีสารสนเทศ', 'เทคโนโลยีสารสนเทศ', 33),
('130309', 304, 'เทคโนโลยีอุตสาหการ', 'เทคโนโลยีอุตสาหการ', 33),
('130310', 305, 'เทคนิคอุตสาหกรรม', 'เทคนิคอุตสาหกรรม', 33),
('130311', 306, 'การแพทย์แผนไทย', 'การแพทย์แผนไทย', 33),
('130312', 307, 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 33),
('130401', 308, 'วิศวกรรมการผลิต', 'วิศวกรรมการผลิต', 34),
('130402', 309, 'วิศวกรรมคอมพิวเตอร์', 'วิศวกรรมคอมพิวเตอร์', 34),
('130403', 310, 'วิศวกรรมสำรวจ', 'วิศวกรรมสำรวจ', 34),
('130404', 311, 'วิศวกรรมอิเล็กทรอนิกส์', 'วิศวกรรมอิเล็กทรอนิกส์', 34),
('130405', 312, 'วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ', 34),
('130406', 313, 'วิศวกรรมเครื่องกล', 'วิศวกรรมเครื่องกล', 34),
('130407', 314, 'วิศวกรรมเครื่องนุ่งห่ม', 'วิศวกรรมเครื่องนุ่งห่ม', 34),
('130408', 315, 'วิศวกรรมโยธา', 'วิศวกรรมโยธา', 34),
('130409', 316, 'วิศวกรรมไฟฟ้า', 'วิศวกรรมไฟฟ้า', 34),
('130410', 317, 'เทคโนโลยีคอมพิวเตอร์', 'เทคโนโลยีคอมพิวเตอร์', 34),
('130411', 318, 'เทคโนโลยีอุตสาหกรรม', 'เทคโนโลยีอุตสาหกรรม', 34),
('130412', 319, 'เทคโนโลยีเครื่องกล', 'เทคโนโลยีเครื่องกล', 34),
('130413', 320, 'วิศวกรรมโทรคมนาคม', 'วิศวกรรมโทรคมนาคม', 34),
('130501', 321, 'การท่องเที่ยว', 'การท่องเที่ยว', 35),
('130502', 322, 'การโรงแรม', 'การโรงแรม', 35),
('130503', 323, 'คหกรรมศาสตร์ทั่วไป ธุรกิจงานประดิษฐ์', 'คหกรรมศาสตร์ทั่วไป ธุรกิจงานประดิษฐ์', 35),
('130504', 324, 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 35),
('130505', 325, 'อาหารและโภชนาการ', 'อาหารและโภชนาการ', 35),
('130506', 326, 'คหกรรมศาสตร์ศึกษา-คหกรรมศาสตร์ทั่วไป', 'คหกรรมศาสตร์ศึกษา-คหกรรมศาสตร์ทั่วไป', 35),
('130507', 327, 'ธุรกิจคหกรรมศาสตร์', 'ธุรกิจคหกรรมศาสตร์', 35),
('130601', 328, 'สัตวแพทยศาสตร์', 'สัตวแพทยศาสตร์', 36),
('130701', 329, 'จิตรกรรม', 'จิตรกรรม', 37),
('130702', 330, 'สถาปัตยกรรม', 'สถาปัตยกรรม', 37),
('130703', 331, 'การออกแบบแฟชั่นและสิ่งทอ', 'การออกแบบแฟชั่นและสิ่งทอ', 37),
('130801', 332, 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร', 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร', 38),
('130802', 333, 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 38),
('130803', 334, 'อาหารและโภชนาการ', 'อาหารและโภชนาการ', 38),
('130804', 335, 'เทคโนโลยีชีวภาพ', 'เทคโนโลยีชีวภาพ', 38),
('130901', 336, 'การจัดการ', 'การจัดการ', 39),
('130902', 337, 'การตลาด', 'การตลาด', 39),
('130903', 338, 'การเงิน', 'การเงิน', 39),
('130904', 339, 'การจัดการโลจิสติกส์', 'การจัดการโลจิสติกส์', 39),
('130905', 340, 'ระบบสารสนเทศทางธุรกิจ', 'ระบบสารสนเทศทางธุรกิจ', 39),
('130906', 341, 'ธุรกิจอิเล็กทรอนิกส์', 'ธุรกิจอิเล็กทรอนิกส์', 39),
('130907', 342, 'การบัญชี', 'การบัญชี', 39),
('130908', 343, 'คอมพิวเตอร์ธุรกิจ', 'คอมพิวเตอร์ธุรกิจ', 39),
('131001', 344, 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 40),
('131002', 345, 'วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ', 40),
('131003', 346, 'เทคโนโลยีการขึ้นรูปโลหะ', 'เทคโนโลยีการขึ้นรูปโลหะ', 40),
('131004', 347, 'เทคโนโลยีปิโตรเลียม', 'เทคโนโลยีปิโตรเลียม', 40),
('131005', 348, 'เทคโนโลยีสื่อสารมวลชน', 'เทคโนโลยีสื่อสารมวลชน', 40),
('131006', 349, 'วิศวกรรมแมคคาทรอนิกส์', 'วิศวกรรมแมคคาทรอนิกส์', 40),
('140101', 351, 'ประมง', 'ประมง', 41),
('140102', 352, 'พืชศาสตร์', 'พืชศาสตร์', 41),
('140103', 353, 'สัตวศาสตร์', 'สัตวศาสตร์', 41),
('140104', 354, 'เกษตรกลวิธาน', 'เกษตรกลวิธาน', 41),
('140105', 355, 'เทคโนโลยีการผลิตพืช', 'เทคโนโลยีการผลิตพืช', 41),
('140106', 356, 'เทคโนโลยีภูมิทัศน์', 'เทคโนโลยีภูมิทัศน์', 41),
('140107', 357, 'เทคโนโลยีเครื่องจักรกลเกษตร', 'เทคโนโลยีเครื่องจักรกลเกษตร', 41),
('140108', 358, 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 41),
('140109', 359, 'การเพาะเลี้ยงสัตว์น้ำและการจัดการทรัพยากรประมง', 'การเพาะเลี้ยงสัตว์น้ำและการจัดการทรัพยากรประมง', 41),
('140201', 360, 'การจัดการ', 'การจัดการ', 42),
('140202', 361, 'การตลาด', 'การตลาด', 42),
('140203', 362, 'การเงิน', 'การเงิน', 42),
('140204', 363, 'ระบบสารสนเทศทางธุรกิจ', 'ระบบสารสนเทศทางธุรกิจ', 42),
('140205', 364, 'การบัญชี', 'การบัญชี', 42),
('140206', 365, 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 42),
('140301', 366, 'ชีววิทยาประยุกต์', 'ชีววิทยาประยุกต์', 43),
('140302', 367, 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 43),
('140303', 368, 'เคมี', 'เคมี', 43),
('140304', 369, 'เคมีอุตสาหกรรม', 'เคมีอุตสาหกรรม', 43),
('140305', 370, 'เทคโนโลยีการยาง', 'เทคโนโลยีการยาง', 43),
('140306', 371, 'เทคโนโลยีการอาหาร', 'เทคโนโลยีการอาหาร', 43),
('140307', 372, 'เทคโนโลยีคอมพิวเตอร์', 'เทคโนโลยีคอมพิวเตอร์', 43),
('140308', 373, 'เทคโนโลยีสารสนเทศ', 'เทคโนโลยีสารสนเทศ', 43),
('140309', 374, 'เทคโนโลยีอุตสาหการ', 'เทคโนโลยีอุตสาหการ', 43),
('140310', 375, 'เทคนิคอุตสาหกรรม', 'เทคนิคอุตสาหกรรม', 43),
('140311', 376, 'การแพทย์แผนไทย', 'การแพทย์แผนไทย', 43),
('140312', 377, 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 43),
('140401', 378, 'วิศวกรรมการผลิต', 'วิศวกรรมการผลิต', 44),
('140402', 379, 'วิศวกรรมคอมพิวเตอร์', 'วิศวกรรมคอมพิวเตอร์', 44),
('140403', 380, 'วิศวกรรมสำรวจ', 'วิศวกรรมสำรวจ', 44),
('140404', 381, 'วิศวกรรมอิเล็กทรอนิกส์', 'วิศวกรรมอิเล็กทรอนิกส์', 44),
('140405', 382, 'วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ', 44),
('140406', 383, 'วิศวกรรมเครื่องกล', 'วิศวกรรมเครื่องกล', 44),
('140407', 384, 'วิศวกรรมเครื่องนุ่งห่ม', 'วิศวกรรมเครื่องนุ่งห่ม', 44),
('140408', 385, 'วิศวกรรมโยธา', 'วิศวกรรมโยธา', 44),
('140409', 386, 'วิศวกรรมไฟฟ้า', 'วิศวกรรมไฟฟ้า', 44),
('140410', 387, 'เทคโนโลยีคอมพิวเตอร์', 'เทคโนโลยีคอมพิวเตอร์', 44),
('140411', 388, 'เทคโนโลยีอุตสาหกรรม', 'เทคโนโลยีอุตสาหกรรม', 44),
('140412', 389, 'เทคโนโลยีเครื่องกล', 'เทคโนโลยีเครื่องกล', 44),
('140413', 390, 'วิศวกรรมโทรคมนาคม', 'วิศวกรรมโทรคมนาคม', 44),
('140501', 391, 'การท่องเที่ยว', 'การท่องเที่ยว', 5),
('140502', 392, 'การโรงแรม', 'การโรงแรม', 45),
('140503', 393, 'คหกรรมศาสตร์ทั่วไป ธุรกิจงานประดิษฐ์', 'คหกรรมศาสตร์ทั่วไป ธุรกิจงานประดิษฐ์', 45),
('140504', 394, 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 45),
('140505', 395, 'อาหารและโภชนาการ', 'อาหารและโภชนาการ', 45),
('140506', 396, 'คหกรรมศาสตร์ศึกษา-คหกรรมศาสตร์ทั่วไป', 'คหกรรมศาสตร์ศึกษา-คหกรรมศาสตร์ทั่วไป', 45),
('140507', 397, 'ธุรกิจคหกรรมศาสตร์', 'ธุรกิจคหกรรมศาสตร์', 45),
('140601', 398, 'สัตวแพทยศาสตร์', 'สัตวแพทยศาสตร์', 46),
('140701', 399, 'จิตรกรรม', 'จิตรกรรม', 47),
('140702', 400, 'สถาปัตยกรรม', 'สถาปัตยกรรม', 47),
('140703', 401, 'การออกแบบแฟชั่นและสิ่งทอ', 'การออกแบบแฟชั่นและสิ่งทอ', 47),
('140801', 402, 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร', 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร', 48),
('140802', 403, 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 48),
('140803', 404, 'อาหารและโภชนาการ', 'อาหารและโภชนาการ', 48),
('140804', 405, 'เทคโนโลยีชีวภาพ', 'เทคโนโลยีชีวภาพ', 48),
('140901', 406, 'การจัดการ', 'การจัดการ', 49),
('140902', 407, 'การตลาด', 'การตลาด', 49),
('140903', 408, 'การเงิน', 'การเงิน', 49),
('140904', 409, 'การจัดการโลจิสติกส์', 'การจัดการโลจิสติกส์', 49),
('140905', 410, 'ระบบสารสนเทศทางธุรกิจ', 'ระบบสารสนเทศทางธุรกิจ', 49),
('140906', 411, 'ธุรกิจอิเล็กทรอนิกส์', 'ธุรกิจอิเล็กทรอนิกส์', 49),
('140907', 412, 'การบัญชี', 'การบัญชี', 49),
('140908', 413, 'คอมพิวเตอร์ธุรกิจ', 'คอมพิวเตอร์ธุรกิจ', 49),
('141001', 414, 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 50),
('141002', 415, 'วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ', 50),
('141003', 416, 'เทคโนโลยีการขึ้นรูปโลหะ', 'เทคโนโลยีการขึ้นรูปโลหะ', 50),
('141004', 417, 'เทคโนโลยีปิโตรเลียม', 'เทคโนโลยีปิโตรเลียม', 50),
('141005', 418, 'เทคโนโลยีสื่อสารมวลชน', 'เทคโนโลยีสื่อสารมวลชน', 50),
('141006', 419, 'วิศวกรรมแมคคาทรอนิกส์', 'วิศวกรรมแมคคาทรอนิกส์', 50),
('150101', 421, 'ประมง', 'ประมง', 51),
('150102', 422, 'พืชศาสตร์', 'พืชศาสตร์', 51),
('150103', 423, 'สัตวศาสตร์', 'สัตวศาสตร์', 51),
('150104', 424, 'เกษตรกลวิธาน', 'เกษตรกลวิธาน', 51),
('150105', 425, 'เทคโนโลยีการผลิตพืช', 'เทคโนโลยีการผลิตพืช', 51),
('150106', 426, 'เทคโนโลยีภูมิทัศน์', 'เทคโนโลยีภูมิทัศน์', 51),
('150107', 427, 'เทคโนโลยีเครื่องจักรกลเกษตร', 'เทคโนโลยีเครื่องจักรกลเกษตร', 51),
('150108', 428, 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 51),
('150109', 429, 'การเพาะเลี้ยงสัตว์น้ำและการจัดการทรัพยากรประมง', 'การเพาะเลี้ยงสัตว์น้ำและการจัดการทรัพยากรประมง', 51),
('150201', 430, 'การจัดการ', 'การจัดการ', 52),
('150202', 431, 'การตลาด', 'การตลาด', 52),
('150203', 432, 'การเงิน', 'การเงิน', 52),
('150204', 433, 'ระบบสารสนเทศทางธุรกิจ', 'ระบบสารสนเทศทางธุรกิจ', 52),
('150205', 434, 'การบัญชี', 'การบัญชี', 52),
('150206', 435, 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 52),
('150301', 436, 'ชีววิทยาประยุกต์', 'ชีววิทยาประยุกต์', 53),
('150302', 437, 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 53),
('150303', 438, 'เคมี', 'เคมี', 53),
('150304', 439, 'เคมีอุตสาหกรรม', 'เคมีอุตสาหกรรม', 53),
('150305', 440, 'เทคโนโลยีการยาง', 'เทคโนโลยีการยาง', 53),
('150306', 441, 'เทคโนโลยีการอาหาร', 'เทคโนโลยีการอาหาร', 53),
('150307', 442, 'เทคโนโลยีคอมพิวเตอร์', 'เทคโนโลยีคอมพิวเตอร์', 53),
('150308', 443, 'เทคโนโลยีสารสนเทศ', 'เทคโนโลยีสารสนเทศ', 53),
('150309', 444, 'เทคโนโลยีอุตสาหการ', 'เทคโนโลยีอุตสาหการ', 53),
('150310', 445, 'เทคนิคอุตสาหกรรม', 'เทคนิคอุตสาหกรรม', 53),
('150311', 446, 'การแพทย์แผนไทย', 'การแพทย์แผนไทย', 53),
('150312', 447, 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 53),
('150401', 448, 'วิศวกรรมการผลิต', 'วิศวกรรมการผลิต', 54),
('150402', 449, 'วิศวกรรมคอมพิวเตอร์', 'วิศวกรรมคอมพิวเตอร์', 54),
('150403', 450, 'วิศวกรรมสำรวจ', 'วิศวกรรมสำรวจ', 54),
('150404', 451, 'วิศวกรรมอิเล็กทรอนิกส์', 'วิศวกรรมอิเล็กทรอนิกส์', 54),
('150405', 452, 'วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ', 54),
('150406', 453, 'วิศวกรรมเครื่องกล', 'วิศวกรรมเครื่องกล', 54),
('150407', 454, 'วิศวกรรมเครื่องนุ่งห่ม', 'วิศวกรรมเครื่องนุ่งห่ม', 54),
('150408', 455, 'วิศวกรรมโยธา', 'วิศวกรรมโยธา', 54),
('150409', 456, 'วิศวกรรมไฟฟ้า', 'วิศวกรรมไฟฟ้า', 54),
('150410', 457, 'เทคโนโลยีคอมพิวเตอร์', 'เทคโนโลยีคอมพิวเตอร์', 54),
('150411', 458, 'เทคโนโลยีอุตสาหกรรม', 'เทคโนโลยีอุตสาหกรรม', 54),
('150412', 459, 'เทคโนโลยีเครื่องกล', 'เทคโนโลยีเครื่องกล', 54),
('150413', 460, 'วิศวกรรมโทรคมนาคม', 'วิศวกรรมโทรคมนาคม', 54),
('150501', 461, 'การท่องเที่ยว', 'การท่องเที่ยว', 55),
('150502', 462, 'การโรงแรม', 'การโรงแรม', 55),
('150503', 463, 'คหกรรมศาสตร์ทั่วไป ธุรกิจงานประดิษฐ์', 'คหกรรมศาสตร์ทั่วไป ธุรกิจงานประดิษฐ์', 55),
('150504', 464, 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 55),
('150505', 465, 'อาหารและโภชนาการ', 'อาหารและโภชนาการ', 55),
('150506', 466, 'คหกรรมศาสตร์ศึกษา-คหกรรมศาสตร์ทั่วไป', 'คหกรรมศาสตร์ศึกษา-คหกรรมศาสตร์ทั่วไป', 55),
('150507', 467, 'ธุรกิจคหกรรมศาสตร์', 'ธุรกิจคหกรรมศาสตร์', 55),
('150601', 468, 'สัตวแพทยศาสตร์', 'สัตวแพทยศาสตร์', 56),
('150701', 469, 'จิตรกรรม', 'จิตรกรรม', 57),
('150702', 470, 'สถาปัตยกรรม', 'สถาปัตยกรรม', 57),
('150703', 471, 'การออกแบบแฟชั่นและสิ่งทอ', 'การออกแบบแฟชั่นและสิ่งทอ', 57),
('150801', 472, 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร', 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร', 58),
('150802', 473, 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 58),
('150803', 474, 'อาหารและโภชนาการ', 'อาหารและโภชนาการ', 58),
('150804', 475, 'เทคโนโลยีชีวภาพ', 'เทคโนโลยีชีวภาพ', 58),
('150901', 476, 'การจัดการ', 'การจัดการ', 59),
('150902', 477, 'การตลาด', 'การตลาด', 59),
('150903', 478, 'การเงิน', 'การเงิน', 59),
('150904', 479, 'การจัดการโลจิสติกส์', 'การจัดการโลจิสติกส์', 59),
('150905', 480, 'ระบบสารสนเทศทางธุรกิจ', 'ระบบสารสนเทศทางธุรกิจ', 59),
('150906', 481, 'ธุรกิจอิเล็กทรอนิกส์', 'ธุรกิจอิเล็กทรอนิกส์', 59),
('150907', 482, 'การบัญชี', 'การบัญชี', 59),
('150908', 483, 'คอมพิวเตอร์ธุรกิจ', 'คอมพิวเตอร์ธุรกิจ', 59),
('151001', 484, 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 'วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 60),
('151002', 485, 'วิศวกรรมอุตสาหการ', 'วิศวกรรมอุตสาหการ', 60),
('151003', 486, 'เทคโนโลยีการขึ้นรูปโลหะ', 'เทคโนโลยีการขึ้นรูปโลหะ', 60),
('151004', 487, 'เทคโนโลยีปิโตรเลียม', 'เทคโนโลยีปิโตรเลียม', 60),
('151005', 488, 'เทคโนโลยีสื่อสารมวลชน', 'เทคโนโลยีสื่อสารมวลชน', 60),
('151006', 489, 'วิศวกรรมแมคคาทรอนิกส์', 'วิศวกรรมแมคคาทรอนิกส์', 60);

-- --------------------------------------------------------

--
-- Table structure for table `geographies`
--

CREATE TABLE `geographies` (
  `id` int(11) NOT NULL,
  `name` varchar(255) COLLATE utf8_bin NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='InnoDB free: 8192 kB';

--
-- Dumping data for table `geographies`
--

INSERT INTO `geographies` (`id`, `name`) VALUES
(1, 'ภาคเหนือ'),
(2, 'ภาคกลาง'),
(3, 'ภาคตะวันออกเฉียงเหนือ'),
(4, 'ภาคตะวันตก'),
(5, 'ภาคตะวันออก'),
(6, 'ภาคใต้');

-- --------------------------------------------------------

--
-- Table structure for table `provinces`
--

CREATE TABLE `provinces` (
  `id` int(5) NOT NULL,
  `code` varchar(2) COLLATE utf8_unicode_ci NOT NULL,
  `name_th` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `name_en` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `geography_id` int(5) NOT NULL DEFAULT 0
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `provinces`
--

INSERT INTO `provinces` (`id`, `code`, `name_th`, `name_en`, `geography_id`) VALUES
(1, '10', 'สงขลา', 'สงขลา', 1),
(2, '11', 'วิทยาลัยรัตภูมิ', 'วิทยาลัยรัตภูมิ', 1),
(3, '12', 'วิทยาเขตตรัง', 'วิทยาเขตตรัง', 1),
(4, '13', 'วิทยาเขตนครศรีธรรมราช พื้นที่ไสใหญ่', 'วิทยาเขตนครศรีธรรมราช พื้นที่ไสใหญ่', 1),
(5, '14', 'วิทยาเขตนครศรีธรรมราช พื้นที่ทุ่งใหญ่', 'วิทยาเขตนครศรีธรรมราช พื้นที่ทุ่งใหญ่', 1),
(6, '15', 'วิทยาเขตนครศรีธรรมราช วิทยาลัยเทคโนโลยีอุตสาหกรรมและการจัดการ (ขนอม)', 'วิทยาเขตนครศรีธรรมราช วิทยาลัยเทคโนโลยีอุตสาหกรรมและการจัดการ (ขนอม)', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `amphures`
--
ALTER TABLE `amphures`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `districts`
--
ALTER TABLE `districts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `geographies`
--
ALTER TABLE `geographies`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `provinces`
--
ALTER TABLE `provinces`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `amphures`
--
ALTER TABLE `amphures`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1007;

--
-- AUTO_INCREMENT for table `geographies`
--
ALTER TABLE `geographies`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `provinces`
--
ALTER TABLE `provinces`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=78;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
